cf/Catalogs/НастройкиPostman.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиPostman</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтчетыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеудач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьОчетыСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/НастройкиPostman.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиPostman</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/НастройкиPostman/Forms/ФормаАдминистрирования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчетнаяЗаписьЭлектроннойПочты = РегистрыСведений.НастройкиPostman.Получить(Новый Структура("Ключ","УчетнаяЗаписьЭлектроннойПочты")).Значение;
	EmailАдминистратора = РегистрыСведений.НастройкиPostman.Получить(Новый Структура("Ключ","EmailАдминистратора")).Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьТаблицуОтчетов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛог(Команда)
	ОткрытьФорму("РегистрСведений.ЛогPostman.ФормаСписка");
КонецПроцедуры

//Таблица
#Область Таблица 

&НаКлиенте
Процедура ОбновитьТаблицу(Команда)
	ЗаполнитьТаблицуОтчетов()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОтчетов()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиPostmanПолучатели.Ссылка КАК Отчет
	|ИЗ
	|	Справочник.НастройкиPostman.Получатели КАК НастройкиPostmanПолучатели
	|ГДЕ
	|	НастройкиPostmanПолучатели.Получатель = &Пользователь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Отчет
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Таблица.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьПользователяИзРассылки(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("УбратьПользователяИзРассылкиПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Продолжить выполнение операции?", Режим);
КонецПроцедуры

&НаКлиенте
Процедура УбратьПользователяИзРассылкиПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Попытка
	   КоличествоУдаленных = УбратьПользователяИзРассылкиНаСервере(Пользователь);
	   Если КоличествоУдаленных = 0 Тогда
	   
		  ПоказатьОповещениеПользователя(,," Не выбрано ни одного элемента"); 
		   
	   Иначе
		  ПоказатьОповещениеПользователя(,," Пользователь " + Пользователь + " исключен из " + КоличествоУдаленных + " элементов" );
	   КонецЕсли;
	    
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки;
	ЗаполнитьТаблицуОтчетов()
	
КонецПроцедуры


&НаСервере
Функция УбратьПользователяИзРассылкиНаСервере(Пользователь)
	Сч = 0;
	Для каждого Строка Из Таблица Цикл
	    Если Не Строка.Флаг Тогда
			Продолжить;
		КонецЕсли;
		Спр = Строка.Отчет.ПолучитьОбъект();
		МассивНайденных = Спр.Получатели.НайтиСтроки(Новый Структура("Получатель",Пользователь));
		
		Для каждого Эл Из МассивНайденных Цикл
		    Сч = Сч + 1;
			Спр.Получатели.Удалить(Эл);
		
		КонецЦикла;
		Спр.Записать();
	КонецЦикла;
    Возврат Сч
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Эл Из Таблица Цикл
		Эл.Флаг = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для каждого Эл Из Таблица Цикл
		Эл.Флаг = Ложь;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

//Применить Закрыть
#Область Применить_Закрыть
&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	НЗ = РегистрыСведений.НастройкиPostman.СоздатьНаборЗаписей();
	Запись = НЗ.Добавить();
	Запись.Ключ = "УчетнаяЗаписьЭлектроннойПочты";
	Запись.Значение = УчетнаяЗаписьЭлектроннойПочты;
	
	Запись = НЗ.Добавить();
	Запись.Ключ = "EmailАдминистратора";
	Запись.Значение = EmailАдминистратора;
	НЗ.Записать();	
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Отказ = Истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Данные были изменены. Сохранить?", Режим);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПрименитьНаСервере();
	КонецЕсли;
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

#КонецОбласти
